# see 0_party_names.ipynb for more details

may13_rename_map = {}
oct14_rename_map = {}

mar17_rename_map = {
    'ПП ДРОМ': 'ПП ДРОМ',
    'ПП Движение за радикална промяна Българската пролет': 'БЪЛГАРСКА ПРОЛЕТ',
    'Политическа партия Движение Напред България': 'ДНБ',
    'Нова Република – ДСБ, Съюз за Пловдив, Българска демократична общност': 'ДСБ (коалиция)',
    'КОАЛИЦИЯ НА НЕДОВОЛНИТЕ (БСД – Евролевица, Българска Социалдемократическа партия, Християн-Социален Съюз)': 'КОАЛИЦИЯ НА НЕДОВОЛНИТЕ',
    'ВОЛЯ': 'ВОЛЯ',
    'ПП БЪЛГАРСКИ ДЕМОКРАТИЧЕН ЦЕНТЪР - БДЦ': 'БДЦ',
    'Коалиция АБВ – Движение 21': 'АБВ/Движение 21',
    'Движение за права и свободи – ДПС': 'ДПС',
    'БСП за БЪЛГАРИЯ': 'БСП',
    'ПП ГЕРБ': 'ГЕРБ',
    'партия на ЗЕЛЕНИТЕ': 'Партия на ЗЕЛЕНИТЕ',
    'Обединение ДОСТ': 'ДОСТ',
    'ПП Възраждане': 'ВЪЗР',
    'ДВИЖЕНИЕ ПРЕЗАРЕДИ БЪЛГАРИЯ': 'ДВИЖЕНИЕ ПРЕЗАРЕДИ БЪЛГАРИЯ',
    'КП ДВИЖЕНИЕ ДА БЪЛГАРИЯ (Зелените, ДЕОС)': 'Зелените, ДЕОС',
    'ОБЕДИНЕНИ ПАТРИОТИ – НФСБ, АТАКА и ВМРО': 'ОБЕДИНЕНИ ПАТРИОТИ',
    'КОЙ – Българската левица и Зелена партия': 'КОЙ',
    'ПП НАЦИОНАЛНА РЕПУБЛИКАНСКА ПАРТИЯ': 'НРП',
    'БЪЛГАРСКО НАЦИОНАЛНО ОБЕДИНЕНИЕ': 'БНО',
    'РЕФОРМАТОРСКИ БЛОК – ГЛАС НАРОДЕН': 'РБ-ГЛАС НАРОДЕН',
    'независими1': 'независими1',
    'независими2': 'независими2'
}

apr21_rename_map = {'31' : 'независими'}

jul21_rename_map = {'24' : 'независими'}

nov21_rename_map = {
    'РУСОФИЛИ ЗА ВЪЗРАЖДАНЕ НА ОТЕЧЕСТВОТО' : 'РВО',
    'ПАТРИОТИЧЕН ФРОНТ – НФСБ, БДС РАДИКАЛИ И БНДС ЦЕЛОКУПНА БЪЛГАРИЯ' : 'ПФ',
    'ВЪЗРАЖДАНЕ' : 'ВЪЗР', 
    'НАЦИОНАЛНО ОБЕДИНЕНИЕ НА ДЕСНИЦАТА' : 'НОД',
    'БСДД – Български Съюз за Директна Демокрация' : 'БСДД',
    'БЪЛГАРСКА СОЦИАЛДЕМОКРАЦИЯ – ЕВРОЛЕВИЦА' : 'ЕВРОЛЕВИЦА', 
    'АТАКА' : 'АТАКА',
    'ПП ОБЩЕСТВО ЗА НОВА БЪЛГАРИЯ' : 'ОНБ', 
    'ПП ГЛАС НАРОДЕН' : 'ГЛАС НАРОДЕН',
    'Движение за права и свободи – ДПС' : 'ДПС', 
    'ПП ПРАВОТО' : 'ПРАВОТО',
    'ВМРО – БЪЛГАРСКО НАЦИОНАЛНО ДВИЖЕНИЕ' : 'ВМРО', 
    'БНО' : 'БНО', 
    'ВОЛЯ' : 'ВОЛЯ',
    'ПП ИМА ТАКЪВ НАРОД' : 'ИТН', 
    'Продължаваме Промяната' : 'ПП', 
    'Партия МИР' : 'МИР',
    'ПП БЛАГОДЕНСТВИЕ – ОБЕДИНЕНИЕ – ГРАДИВНОСТ' : 'БОГ',
    'Български национален съюз – НД' : 'БНС-НД', 
    'ПРЯКА ДЕМОКРАЦИЯ' : 'ПД',
    'ДЕМОКРАТИЧНА БЪЛГАРИЯ – ОБЕДИНЕНИЕ (ДА България, ДСБ, Зелено движение)' : 'ДБ',
    'ИЗПРАВИ СЕ БГ! НИЕ ИДВАМЕ!' : 'ИЗПРАВИ СЕ', 
    'ГЕРБ-СДС' : 'ГЕРБ-СДС', 
    'БСП ЗА БЪЛГАРИЯ' : 'БСП',
    'БЪЛГАРСКА ПРОГРЕСИВНА ЛИНИЯ' : 'БПЛ', 
    'Партия на ЗЕЛЕНИТЕ' : 'Партия на ЗЕЛЕНИТЕ', 
    'БРИГАДА' : 'БРИГАДА',
    'независим' : 'независими'
}

oct22_rename_map = {'независим' : 'независими'}

apr23_rename_map = { # for votes_2023-04-02_scraped.csv
    'Не подкрепям никого' : 'НПН', 
    'БСП ЗА БЪЛГАРИЯ' : 'БСП', 
    'ГЕРБ-СДС' : 'ГЕРБ-СДС', 
    'ВЪЗРАЖДАНЕ' : 'ВЪЗР',
    'ПП ИМА ТАКЪВ НАРОД' : 'ИТН',
    'ПП НАРОДНА ПАРТИЯ ИСТИНАТА И САМО ИСТИНАТА' : 'НП ИСИ',
    'КОАЛИЦИЯ НЕУТРАЛНА БЪЛГАРИЯ (АТАКА, РУСОФИЛИ, КОМУНИСТИ)' : 'АТАКА (к.)',
    'Българско Национално Обединение' : 'БНО', 
    'ЗАЕДНО' : 'ЗАЕДНО',
    'БЪЛГАРСКИ НАЦИОНАЛЕН СЪЮЗ – НД' : 'БНС-НД', 
    'НДСВ' : 'НДСВ',
    'КОД /Консервативно Обединение на Десницата/' : 'КОД',
    'КОАЛИЦИЯ ПРОДЪЛЖАВАМЕ ПРОМЯНАТА – ДЕМОКРАТИЧНА БЪЛГАРИЯ' : 'ПП/ДБ',
    'Движение за права и свободи – ДПС' : 'ДПС', 
    'ЛЕВИЦАТА!' : 'ЛЕВИЦАТА', 
    'ПП БЪЛГАРСКИ ВЪЗХОД' : 'БВ',
    'МИР' : 'МИР', 
    'БЪЛГАРСКА СОЦИАЛДЕМОКРАЦИЯ – ЕВРОЛЕВИЦА' : 'ЕВРОЛЕВИЦА',
    'БСДД – Български Съюз за ДИРЕКТНА ДЕМОКРАЦИЯ' : 'БСДД', 
    'ПП Глас Народен' : 'ГЛАС НАРОДЕН',
    'Социалистическа партия Български път' : 'СПБП', 
    'ВЪН от ЕС и НАТО' : 'ВЪН ОТ ЕС',
    'независим' : 'независими'
}

